<a href="https://colab.research.google.com/github/benjaminjeremiah/HamoyeDataScience/blob/master/Lesson_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#convention for importing numpy

In [9]:
import pandas as pd

In [4]:
days = pd.Series(['Monday', 'Tuesday', 'Wednesday'])

In [5]:
print(days) #print days

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [10]:
import numpy as np

In [8]:
#creating series with a numpy array

In [11]:
day_list = np.array(['Monday', 'Tuesday', 'Wednesday'])

In [12]:
numpy_days = pd.Series(day_list)

In [13]:
print(numpy_days)

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [14]:
#using strings as index

In [18]:
days = pd.Series(['Monday', 'Tuesday', 'Wednesday'], index = ['a', 'b', 'c'])

In [17]:
#create series from a dictionary

In [19]:
days1 = pd.Series({'a':'Monday', 'b':'Tuesday', 'c':'Wednesday'})

In [20]:
print(days)

a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [21]:
print(days1)

a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [22]:
#accesing series using index

In [24]:
days[0]

'Monday'

In [25]:
days[1:]

b      Tuesday
c    Wednesday
dtype: object

In [26]:
days['c']

'Wednesday'

In [27]:
print(pd.DataFrame()) #prints an empty dataframe

Empty DataFrame
Columns: []
Index: []

In [28]:
#create a dataframe from a dictionary

In [29]:
df_dict = {'Country': ['Ghana', 'Kenya', 'Nigeria', 'Togo'],
           'Capital': ['Accra', 'Nairobi', 'Abuja', 'Lome'],
           'Population': ['10000', '8500', '35000', '12000'],
           'Age': ['60', '70', '80', '75']}

In [30]:
df = pd.DataFrame(df_dict, index = [2,4,6,8])

In [31]:
df_list = [['Ghana', 'Accra', '10000', '60'],
           ['Kenya', 'Nairobi', '8500', '70'],
           ['Nigeria', 'Abuja', '35000', '80'],
           ['Togo', 'Lome', '12000', '75']]  #create dataframe from list

In [32]:
df1 = pd.DataFrame(df_list, columns=['Country', 'Capital', 'Population', 'Age'], index = [2,4,6,8])

In [34]:
print(df)

   Country  Capital Population Age
2    Ghana    Accra      10000  60
4    Kenya  Nairobi       8500  70
6  Nigeria    Abuja      35000  80
8     Togo     Lome      12000  75

In [35]:
print(df1)

   Country  Capital Population Age
2    Ghana    Accra      10000  60
4    Kenya  Nairobi       8500  70
6  Nigeria    Abuja      35000  80
8     Togo     Lome      12000  75

In [36]:
df.iloc[3]

Country        Togo
Capital        Lome
Population    12000
Age              75
Name: 8, dtype: object

In [37]:
df.loc[6] #select row with index label 6

Country       Nigeria
Capital         Abuja
Population      35000
Age                80
Name: 6, dtype: object

In [38]:
df['Capital']

2      Accra
4    Nairobi
6      Abuja
8       Lome
Name: Capital, dtype: object

In [40]:
df.at[6, 'Country']

'Nigeria'

In [41]:
df.iat[2,0]

'Nigeria'

In [45]:
df['Population'].sum()

'1000085003500012000'

In [58]:
df.mean()

Population    2.500213e+17
Age           1.517702e+07
dtype: float64

In [47]:
df.describe()

        Country  Capital Population Age
count         4        4          4   4
unique        4        4          4   4
top     Nigeria  Nairobi       8500  70
freq          1        1          1   1

In [48]:
df_dict2 = {'Name': ['James', 'Yemen', 'caro', np.nan],
            'Profession': ['Reasearcher', 'Artist', 'Doctor', 'Writer'],
            'Experience': [12, np.nan, 10, 8],
            'Height': [np.nan, 175, 180, 150]}

In [49]:
new_df = pd.DataFrame(df_dict2)

In [50]:
print(new_df)

    Name   Profession  Experience  Height
0  James  Reasearcher        12.0     NaN
1  Yemen       Artist         NaN   175.0
2   caro       Doctor        10.0   180.0
3    NaN       Writer         8.0   150.0

In [51]:
#check for cells with missing values as True

In [52]:
new_df.isnull()

    Name  Profession  Experience  Height
0  False       False       False    True
1  False       False        True   False
2  False       False       False   False
3   True       False       False   False

In [53]:
#remove rows with missing values

In [54]:
new_df.dropna()

   Name Profession  Experience  Height
2  caro     Doctor        10.0   180.0

In [56]:
new_df['Height'].sum()

505.0

In [59]:
new_df.mean()

Experience     10.000000
Height        168.333333
dtype: float64

In [60]:
new_df.describe()

       Experience      Height
count         3.0    3.000000
mean         10.0  168.333333
std           2.0   16.072751
min           8.0  150.000000
25%           9.0  162.500000
50%          10.0  175.000000
75%          11.0  177.500000
max          12.0  180.000000